from string import Template

system_prompt = Template("\n\n".join([
    "أنت مساعد مخصص لتوليد رد للمستخدم",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم",
    "يجب عليك توليد الرد بالاعتماد على الوثائق المقدَّمة فقط",
    "تجاهل أي وثائق لا تكون ذات صلة باستفسار المستخدم",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد مناسب",
    "يجب أن يكون الرد بنفس لغة استفسار المستخدم",
    "كن مهذبًا ومحترمًا في تعاملك مع المستخدم",
    "كن دقيقًا ومختصرًا في ردك وتجنب المعلومات غير الضرورية",
]))

document_prompt = Template("\n\n".join([
    "## رقم الوثيقة: $doc_num",
    "### المحتوى: $chunk_text"
]))

footer_prompt = Template("\n\n".join([
    "استنادًا فقط إلى الوثائق أعلاه، الرجاء توليد إجابة للمستخدم",
    "##السؤال: "
    "$query",
    "",
    "### الإجابة: "
]))
